; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-8-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-2 - location
	p0-5 - location
	p0-6 - location
	p1-0 - location
	p1-9 - location
	p2-9 - location
	p3-2 - location
	p4-3 - location
	p4-7 - location
	p4-8 - location
	p5-7 - location
	p5-9 - location
	p5-10 - location
	p6-1 - location
	p6-2 - location
	p8-9 - location
	p8-10 - location
	p9-4 - location
	p9-6 - location
	p10-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s10)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s9)
	(empty truck3)
	(at truck4 s9)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s10)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at truck8 s4)
	(empty truck8)
	(at package1 s5)
	(at package2 s7)
	(at package3 s10)
	(at package4 s6)
	(at package5 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 29)
	(= (time-to-walk p0-2 s0) 29)
	(= (time-to-walk s2 p0-2) 38)
	(= (time-to-walk p0-2 s2) 38)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 12)
	(= (time-to-walk p0-5 s0) 12)
	(= (time-to-walk s5 p0-5) 30)
	(= (time-to-walk p0-5 s5) 30)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 56)
	(= (time-to-walk p0-6 s0) 56)
	(= (time-to-walk s6 p0-6) 35)
	(= (time-to-walk p0-6 s6) 35)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 76)
	(= (time-to-walk p1-0 s1) 76)
	(= (time-to-walk s0 p1-0) 51)
	(= (time-to-walk p1-0 s0) 51)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(= (time-to-walk s1 p1-9) 24)
	(= (time-to-walk p1-9 s1) 24)
	(= (time-to-walk s9 p1-9) 50)
	(= (time-to-walk p1-9 s9) 50)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 83)
	(= (time-to-walk p2-9 s2) 83)
	(= (time-to-walk s9 p2-9) 13)
	(= (time-to-walk p2-9 s9) 13)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 55)
	(= (time-to-walk p3-2 s3) 55)
	(= (time-to-walk s2 p3-2) 21)
	(= (time-to-walk p3-2 s2) 21)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 38)
	(= (time-to-walk p4-3 s4) 38)
	(= (time-to-walk s3 p4-3) 55)
	(= (time-to-walk p4-3 s3) 55)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 74)
	(= (time-to-walk p4-7 s4) 74)
	(= (time-to-walk s7 p4-7) 2)
	(= (time-to-walk p4-7 s7) 2)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 53)
	(= (time-to-walk p4-8 s4) 53)
	(= (time-to-walk s8 p4-8) 44)
	(= (time-to-walk p4-8 s8) 44)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 60)
	(= (time-to-walk p5-7 s5) 60)
	(= (time-to-walk s7 p5-7) 46)
	(= (time-to-walk p5-7 s7) 46)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(= (time-to-walk s5 p5-9) 41)
	(= (time-to-walk p5-9 s5) 41)
	(= (time-to-walk s9 p5-9) 99)
	(= (time-to-walk p5-9 s9) 99)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(= (time-to-walk s5 p5-10) 71)
	(= (time-to-walk p5-10 s5) 71)
	(= (time-to-walk s10 p5-10) 2)
	(= (time-to-walk p5-10 s10) 2)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 65)
	(= (time-to-walk p6-1 s6) 65)
	(= (time-to-walk s1 p6-1) 88)
	(= (time-to-walk p6-1 s1) 88)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 21)
	(= (time-to-walk p6-2 s6) 21)
	(= (time-to-walk s2 p6-2) 16)
	(= (time-to-walk p6-2 s2) 16)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 12)
	(= (time-to-walk p8-9 s8) 12)
	(= (time-to-walk s9 p8-9) 50)
	(= (time-to-walk p8-9 s9) 50)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(= (time-to-walk s8 p8-10) 53)
	(= (time-to-walk p8-10 s8) 53)
	(= (time-to-walk s10 p8-10) 23)
	(= (time-to-walk p8-10 s10) 23)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 79)
	(= (time-to-walk p9-4 s9) 79)
	(= (time-to-walk s4 p9-4) 9)
	(= (time-to-walk p9-4 s4) 9)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 58)
	(= (time-to-walk p9-6 s9) 58)
	(= (time-to-walk s6 p9-6) 54)
	(= (time-to-walk p9-6 s6) 54)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(= (time-to-walk s10 p10-0) 60)
	(= (time-to-walk p10-0 s10) 60)
	(= (time-to-walk s0 p10-0) 82)
	(= (time-to-walk p10-0 s0) 82)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 4)
	(= (time-to-drive s3 s0) 4)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 42)
	(= (time-to-drive s4 s0) 42)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 94)
	(= (time-to-drive s0 s1) 94)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 59)
	(= (time-to-drive s9 s1) 59)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 62)
	(= (time-to-drive s0 s2) 62)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 31)
	(= (time-to-drive s9 s3) 31)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 14)
	(= (time-to-drive s3 s4) 14)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 35)
	(= (time-to-drive s5 s4) 35)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 33)
	(= (time-to-drive s10 s4) 33)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 66)
	(= (time-to-drive s3 s5) 66)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 79)
	(= (time-to-drive s7 s5) 79)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 92)
	(= (time-to-drive s8 s5) 92)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 12)
	(= (time-to-drive s10 s5) 12)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 19)
	(= (time-to-drive s0 s6) 19)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 90)
	(= (time-to-drive s1 s6) 90)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 82)
	(= (time-to-drive s10 s6) 82)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 21)
	(= (time-to-drive s0 s7) 21)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 55)
	(= (time-to-drive s3 s7) 55)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 70)
	(= (time-to-drive s4 s7) 70)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 41)
	(= (time-to-drive s8 s7) 41)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 71)
	(= (time-to-drive s9 s7) 71)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 81)
	(= (time-to-drive s0 s8) 81)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 91)
	(= (time-to-drive s3 s8) 91)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 24)
	(= (time-to-drive s4 s8) 24)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 4)
	(= (time-to-drive s6 s8) 4)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 69)
	(= (time-to-drive s2 s9) 69)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 33)
	(= (time-to-drive s9 s10) 33)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at truck1 s3)
	(at truck2 s10)
	(at truck5 s2)
	(at truck6 s9)
	(at truck8 s2)
	(at package1 s7)
	(at package2 s6)
	(at package3 s4)
	(at package4 s7)
	(at package5 s5)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck8 s4)
   deleted: (at driver2 s4) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 1 of 10
2. (drive-truck truck8 s4 s7 driver2)
   deleted: (at truck8 s4)
   added: (at truck8 s7)
   changed: (driven) from 0 to 70
   goals met: 1 of 10
3. (load-truck package2 truck8 s7)
   deleted: (at package2 s7)
   added: (in package2 truck8)
   goals met: 1 of 10
4. (load-truck package3 truck6 s10)
   deleted: (at package3 s10)
   added: (in package3 truck6)
   goals met: 1 of 10
5. (drive-truck truck8 s7 s8 driver2)
   deleted: (at truck8 s7)
   added: (at truck8 s8)
   changed: (driven) from 70 to 111
   goals met: 1 of 10
6. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 10
7. (drive-truck truck2 s3 s5 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (driven) from 111 to 177
   goals met: 1 of 10
8. (board-truck driver3 truck6 s10)
   deleted: (at driver3 s10) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 1 of 10
9. (drive-truck truck6 s10 s4 driver3)
   deleted: (at truck6 s10)
   added: (at truck6 s4)
   changed: (driven) from 177 to 210
   goals met: 1 of 10
10. (load-truck package1 truck2 s5)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   goals met: 1 of 10
11. (unload-truck package3 truck6 s4)
   deleted: (in package3 truck6)
   added: (at package3 s4)
   goals met: 2 of 10
12. (drive-truck truck2 s5 s10 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s10)
   changed: (driven) from 210 to 222
   goals met: 3 of 10
13. (drive-truck truck6 s4 s3 driver3)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   changed: (driven) from 222 to 236
   goals met: 3 of 10
14. (drive-truck truck8 s8 s0 driver2)
   deleted: (at truck8 s8)
   added: (at truck8 s0)
   changed: (driven) from 236 to 317
   goals met: 3 of 10
15. (drive-truck truck6 s3 s9 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s9)
   changed: (driven) from 317 to 348
   goals met: 4 of 10
16. (drive-truck truck2 s10 s9 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s9)
   changed: (driven) from 348 to 381
   goals met: 3 of 10
17. (drive-truck truck2 s9 s7 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s7)
   changed: (driven) from 381 to 452
   goals met: 3 of 10
18. (unload-truck package1 truck2 s7)
   deleted: (in package1 truck2)
   added: (at package1 s7)
   goals met: 4 of 10
19. (drive-truck truck2 s7 s9 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   changed: (driven) from 452 to 523
   goals met: 4 of 10
20. (drive-truck truck2 s9 s10 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s10)
   changed: (driven) from 523 to 556
   goals met: 5 of 10
21. (drive-truck truck8 s0 s6 driver2)
   deleted: (at truck8 s0)
   added: (at truck8 s6)
   changed: (driven) from 556 to 575
   goals met: 5 of 10
22. (unload-truck package2 truck8 s6)
   deleted: (in package2 truck8)
   added: (at package2 s6)
   goals met: 6 of 10
23. (load-truck package4 truck8 s6)
   deleted: (at package4 s6)
   added: (in package4 truck8)
   goals met: 6 of 10
24. (drive-truck truck8 s6 s8 driver2)
   deleted: (at truck8 s6)
   added: (at truck8 s8)
   changed: (driven) from 575 to 579
   goals met: 6 of 10
25. (drive-truck truck6 s9 s3 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s3)
   changed: (driven) from 579 to 610
   goals met: 5 of 10
26. (drive-truck truck8 s8 s7 driver2)
   deleted: (at truck8 s8)
   added: (at truck8 s7)
   changed: (driven) from 610 to 651
   goals met: 5 of 10
27. (drive-truck truck6 s3 s8 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s8)
   changed: (driven) from 651 to 742
   goals met: 5 of 10
28. (unload-truck package4 truck8 s7)
   deleted: (in package4 truck8)
   added: (at package4 s7)
   goals met: 6 of 10
29. (drive-truck truck8 s7 s0 driver2)
   deleted: (at truck8 s7)
   added: (at truck8 s0)
   changed: (driven) from 742 to 763
   goals met: 6 of 10
30. (drive-truck truck6 s8 s7 driver3)
   deleted: (at truck6 s8)
   added: (at truck6 s7)
   changed: (driven) from 763 to 804
   goals met: 6 of 10
31. (drive-truck truck6 s7 s9 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s9)
   changed: (driven) from 804 to 875
   goals met: 7 of 10
32. (drive-truck truck8 s0 s8 driver2)
   deleted: (at truck8 s0)
   added: (at truck8 s8)
   changed: (driven) from 875 to 956
   goals met: 7 of 10
33. (disembark-truck driver2 truck8 s8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s8) (empty truck8)
   goals met: 7 of 10
34. (board-truck driver2 truck1 s8)
   deleted: (at driver2 s8) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 10
35. (drive-truck truck6 s9 s2 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s2)
   changed: (driven) from 956 to 1025
   goals met: 6 of 10
36. (load-truck package5 truck6 s2)
   deleted: (at package5 s2)
   added: (in package5 truck6)
   goals met: 6 of 10
37. (drive-truck truck6 s2 s9 driver3)
   deleted: (at truck6 s2)
   added: (at truck6 s9)
   changed: (driven) from 1025 to 1094
   goals met: 7 of 10
38. (drive-truck truck6 s9 s10 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s10)
   changed: (driven) from 1094 to 1127
   goals met: 6 of 10
39. (drive-truck truck6 s10 s5 driver3)
   deleted: (at truck6 s10)
   added: (at truck6 s5)
   changed: (driven) from 1127 to 1139
   goals met: 6 of 10
40. (unload-truck package5 truck6 s5)
   deleted: (in package5 truck6)
   added: (at package5 s5)
   goals met: 7 of 10
41. (disembark-truck driver2 truck1 s8)
   deleted: (driving driver2 truck1)
   added: (at driver2 s8) (empty truck1)
   goals met: 7 of 10
42. (board-truck driver2 truck8 s8)
   deleted: (at driver2 s8) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 7 of 10
43. (drive-truck truck6 s5 s10 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s10)
   changed: (driven) from 1139 to 1151
   goals met: 7 of 10
44. (drive-truck truck8 s8 s0 driver2)
   deleted: (at truck8 s8)
   added: (at truck8 s0)
   changed: (driven) from 1151 to 1232
   goals met: 7 of 10
45. (drive-truck truck8 s0 s2 driver2)
   deleted: (at truck8 s0)
   added: (at truck8 s2)
   changed: (driven) from 1232 to 1294
   goals met: 8 of 10
46. (disembark-truck driver1 truck2 s10)
   deleted: (driving driver1 truck2)
   added: (at driver1 s10) (empty truck2)
   goals met: 8 of 10
47. (drive-truck truck6 s10 s9 driver3)
   deleted: (at truck6 s10)
   added: (at truck6 s9)
   changed: (driven) from 1294 to 1327
   goals met: 9 of 10
48. (walk driver1 s10 p8-10)
   deleted: (at driver1 s10)
   added: (at driver1 p8-10)
   changed: (walked) from 0 to 23
   goals met: 9 of 10
49. (walk driver1 p8-10 s8)
   deleted: (at driver1 p8-10)
   added: (at driver1 s8)
   changed: (walked) from 23 to 76
   goals met: 9 of 10
50. (board-truck driver1 truck1 s8)
   deleted: (at driver1 s8) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 10
51. (drive-truck truck1 s8 s3 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   changed: (driven) from 1327 to 1418
   goals met: 10 of 10
